# 1. Creating DataFrame from arrays

In [8]:
# import pandas and numpy
import pandas as pd
import numpy as np

In [3]:
# Create an array using numpy
data = np.array([[1,2],[3,4],[4,5],[6,7]])

In [4]:
# Convert the array to a DataFrame
df = pd.DataFrame(data)

In [5]:
#Load  the df
df

   0  1
0  1  2
1  3  4
2  4  5
3  6  7

In [6]:
#Adding rows and column names
df = pd.DataFrame(data, index =['row1', 'row2', 'row3', 'row4'], columns =['col1','col2'])

In [7]:
df

      col1  col2
row1     1     2
row2     3     4
row3     4     5
row4     6     7

# 2. Creating a df using list

In [9]:
datas = [[1,2], [3,4],[5,6],[7,8]]
df1 = pd.DataFrame(datas)
df1

   0  1
0  1  2
1  3  4
2  5  6
3  7  8

# 3.Creating a df using dictionary

In [10]:
#Create a list with potential keys and values
names = ['Sam', 'James', 'Max', 'Mary', 'Dan']
age = [23,23,25,23,29]

In [12]:
# Convert the lists to a dictionary
dict_names = {'Names': names, 'Age': age}
df2 = pd.DataFrame(dict_names)

df2

In [13]:
print(df)

      col1  col2
row1     1     2
row2     3     4
row3     4     5
row4     6     7